package 变量和数据结构.数据类型

/*
    @author wxg
    @date 2021/7/24-0:36
    */
object Interview {
	def main(args: Array[String]): Unit = {
		/*	128:
			原码：00000000 00000000 00000000 10000000
			补码：00000000 00000000 00000000 10000000
			截取最后一个字节：10000000	取反 + 1 得到原码-->表示最大负数-128
		 */

		//	var n: Int = 128
		/*	130：
			原码：00000000 00000000 00000000 10000010
			补码：00000000 00000000 00000000 10000010
			截取最后一个字节：10000010	取反 + 1 得到原码-->表示最大负数-126
		 */
		var n: Int = 130
		var b: Byte = n.toByte

		//10000000	为当前字节范围最小值，约定-128
		//负数补码：符号位不变，其他位按位取反 + 1
		println(b)
	}

}
